{
  "Normal": [
    {  
      "url":"http://jimenaexperience.org/iraq/files/2010/11/Kibbeh-photo.jpg",
      "foodName":"Kebbeh",
      "theOrigin":"Syrian",
      "ingredients":"2½ lbs ground beef 3 tbsp flour 1 tbsp oil 1 tsp salt 1 tsp pepper 1 tbsp zhoug 3 tbsp oil 1 cup finely chopped onions 1 cup sliced mushrooms 1 cup chopped parsley 3 eggs",
      "theRecipe":"Combine ground beef with flour, 1 tbsp oil, salt, pepper and zhoug then Form the meat mixture into a 10-inch loaf then Make a well the entire length of the loaf then Heat 3 tbsp of oil in a skillet then Saute together the onions, mushrooms and parsley until the onions are golden then Place the mixture in the well of the loaf then Lightly beat the eggs and pour over the vegetables then Preheat oven to 350°F then Pat the sides of the loaf together to close up the well and wrap in aluminum foil then Bake for 30 minutes and The loaf may be served either hot or cold",
      "dayofweek": "sunday"
    },{  
      "url":"http://del.h-cdn.co/assets/16/29/1600x800/landscape-1469126666-beef-taco-saladl1.jpg",
      "foodName":"Beef Taco Salad",
      "theOrigin":"American",
      "ingredients":"3 pounds lean ground beef 5 tablespoons ground oregano 5 tablespoons dried parsley, crushed 1 clove garlic, chopped 1 (1 ounce) package dry onion soup mix 2 cups Italian-style dry bread crumbs 3 (28 ounce) jars spaghetti sauce",
      "theRecipe":"Preheat oven to 350 degrees F (175 degrees C) Lightly grease a 10x15 inch jellyroll pan In a large mixing bowl, combine ground beef, oregano, parsley and garlic. Mix in onion soup mix and seasoned bread crumbs Mix thoroughly Using a 1 ounce scoop, scoop and shape the meat mixture into balls Place in the prepared pan and bake in a preheated oven for 1 hour or until meatballs are browned and cooked through In a large pot over high heat, bring the spaghetti sauce to a boil and add cooked meatballs Reduce heat and simmer for 4 hours",
      "dayofweek": "monday"
    },{  
      "url": "http://images.media-allrecipes.com/userphotos/600x600/23610.jpg",
      "foodName":"kızarmış tavu",
      "theOrigin":"Turkish",
      "ingredients":"2 tablespoons olive oil, divided 8 boneless chicken thighs, with skin 1 (6 ounce) can tomato paste 1/4 cup water 8 cloves garlic, halved salt and pepper to taste 4 medium potatoes, sliced 4 tomatoes, sliced 1 large onion, sliced 1 cup fresh mushrooms, sliced 8 pepperoncini peppers (optional)",
      "theRecipe":"Preheat oven to 325 degrees F (165 degrees C) then Trickle 1 tablespoon olive oil in the bottom of a roasting pan. Arrange chicken thighs in the pan. Mix the tomato paste and water, and spread over the chicken. Place garlic clove halves in the pan. Season chicken with salt and pepper. Arrange potatoes, tomatoes, onion, mushrooms, and pepperoncini over the chicken. Sprinkle with remaining tablespoon olive oil then Bake 1 1/2 hours in the preheated oven, until vegetables are tender and chicken juices run clear. Periodically pour a little water into the pan if it starts to get dry.",
      "dayofweek": "tusday"
    },{  
      "url": "http://images.media-allrecipes.com/userphotos/250x250/65396.jpg",
      "foodName":"Clams Kokkinisto",
      "theOrigin":"Greek",
      "ingredients":"1/2 cup chopped onion 2 large stalks celery, chopped 4 cloves garlic, minced 2 tablespoons olive oil 1 (28 ounce) can canned peeled and diced tomatoes 1 (6 ounce) can tomato paste 2 (7 ounce) cans whole baby clams, undrained 4 bay leaves 1/2 teaspoon chili pepper flakes 2 teaspoons dried oregano salt and pepper to taste 2 tablespoons olive oil.",
      "theRecipe":"In a large saucepan, saute the onion, celery, and garlic in 2 tablespoons olive oil until tender. Stir in tomatoes, tomato paste, and clams. Season with bay leaves, chili pepper flakes, oregano, and salt and pepper to taste. Cover, and simmer for 1 hour, until tomatoes begin to turn deep red in colour and the sauce thickens. Stir in remaining 2 tablespoons olive oil near the end of the cooking time.",
      "dayofweek": "wednesday"
    },{  
      "url": "http://images.media-allrecipes.com/userphotos/250x250/383212.jpg",
      "foodName":"Spaghetti Italian",
      "theOrigin":"Italyan",
      "ingredients":"1/2 pound Italian sausage 4 (6.5 ounce) cans tomato sauce 1 (14.5 ounce) can diced tomatoes 2 bay leaves 1 teaspoon Italian seasoning 1/2 teaspoon garlic powder 1 teaspoon dried basil 1 teaspoon dried oregano salt and pepper to taste 1 (8 ounce) package spaghetti",
      "theRecipe":"",
      "dayofweek": "thursday"
    },{  
      "url": "http://img.sndimg.com/food/image/upload/w_555,h_416,c_fit,fl_progressive,q_95/v1/img/recipes/34/76/07/pic9H9Zgk.jpg",
      "foodName":"Chinese Fried Rice With Egg",
      "theOrigin":" Chinese",
      "ingredients":"3 eggs (or use as many eggs as desired) 1 tablespoon water 1 tablespoon butter 2 -3 tablespoons oil 1 medium onion, finely chopped 3 garlic cloves, coarsely chopped (or use as much garlic as you desired) 4 cups cold cooked white rice 4 tablespoons soy sauce (more to taste) 1 teaspoon sesame oil (you could omit but it is best to add in) 1⁄2 teaspoon fresh ground black pepper 2 green onions, finely chopped (optional)",
      "theRecipe":"In a small bowl beat the eggs with water. Melt the butter in a large skillet or a wok over medium heat or until sizzling. Add in eggs and leave flat for about 2 minutes or until cooked through; remove to a plate then chop. Heat oil in the same skillet; add in onion and saute until softened (about 3-4 minutes, adding in the garlic the last 2 minutes of cooking time). Add in cold rice, soy sauce, sesame oil and black pepper; stir-fry tossing continuously for about 5 minutes (adding in more soy sauce and black pepper if needed to suit taste). Stir in the egg and green onion.",
      "dayofweek": "friday"
    },{  
      "url": "http://images.media-allrecipes.com/userphotos/600x600/378540.jpg",
      "foodName":"Cordon Bleu ",
      "theOrigin":"French",
      "ingredients":"6 skinless, boneless chicken breast halves 6 slices Swiss cheese 6 slices ham 3 tablespoons all-purpose flour 1 teaspoon paprika 6 tablespoons butter 1/2 cup dry white wine 1 teaspoon chicken bouillon granules 1 tablespoon cornstarch 1 cup heavy whipping cream",
      "theRecipe":" Pound chicken breasts if they are too thick. Place a cheese and ham slice on each breast within 1/2 inch of the edges. Fold the edges of the chicken over the filling, and secure with toothpicks. Mix the flour and paprika in a small bowl, and coat the chicken pieces. Heat the butter in a large skillet over medium-high heat, and cook the chicken until browned on all sides. Add the wine and bouillon. Reduce heat to low, cover, and simmer for 30 minutes, until chicken is no longer pink and juices run clear. Remove the toothpicks, and transfer the breasts to a warm platter. Blend the cornstarch with the cream in a small bowl, and whisk slowly into the skillet. Cook, stirring until thickened, and pour over the chicken. Serve warm.",
      "dayofweek": "saterday"
    }
  ],
  "Vegetarian": [
    {  
      "url": "http://keasberry.com/wp-content/uploads/2014/09/mie_tek_tek_keasberry1-680x450.jpg",
      "foodName":"Mie Tek Tek",
      "theOrigin":"Indonisian",
      "ingredients":"14 oz egg noodles 2 egg 2 tablespoons vegetable oil 2 small onions, sliced thin 5 cloves garlic, minced 8 oz chicken breast, cut into cubes 1.7 oz  ham sliced in strips (optional) 3 red chili peppers, thinly sliced 2 stalk of green onions, chopped in 2 inches 1 tablespoon celery, thinly sliced 2 tablespoons kecap manis salt to taste 4 oz cabbage, shredded",
      "theRecipe":"Cook the dried noodles al dente and drain, rinse in cold water and drain again. Set aside. Beat the eggs with a pinch of salt . Bake a thin omelet and let it cool. Roll it up and cut it into strips. Set aside. Fry the onions and garlic in oil until fragrant. Add the chicken and ham and stir fry for a few times. Then add the noodles and vegetables, except the cabbage. Toss the noodles and all ingredients until well combined. Add the kecap manis (sweet soy sauce) and salt to taste. Stir fry for a couple of minutes. Add the cabbage and stir for another minute. Serve immediately, garnished with the strips of omelet and some fried onions",
      "dayofweek": "sunday"
    },{  
      "url": "https://s3.amazonaws.com/images.chefinyou.com/articles/12-fantastic-fried-rice-recipes-from-asian-continent/Nasi_Goreng-_Indonesian_Fried_Rice-3.JPG",
      "foodName":"Nasi Goreng",
      "theOrigin":"Indonisian",      
      "ingredients":"4 c Long-grain rice 8 Shallots or 1 small onion 4 Red chillis or 2 tsp chilli -powder and 2 tsp paprika 4 tb Vegetable oil Salt 2 ts Sweet soya sauce 2 ts Tomato ketchup",
      "theRecipe":"The name Nasi Goreng means simply ‘fried rice’, and it is really a collective description of an indefinite number of slightly differing dishes. You can vary the trimmings and garnishes to suit your taste; but even the most elaborate Nasi Goreng is quick to make. It is a particularly good luncheon dish. Boil the rice a good long time before you intend to fry it; you can fry freshly boiled rice, but the Nasi Goreng will be better if the boiled rice is allowed to cool. Two hours is a satisfactory interval. Leaving the rice to cool overnight, however, gives less good results-the rice has time to go dry and stale. An important point to note here is that rice for Nasi Goreng must be cooked with the least possible quantity of water; this prevents it from becoming too soft. For 1 cup of rice, use 1 cup of water. Assuming you have now got your cool, boiled rice, proceed like this: slice the shallots or onion, seed and slice the chilli (or pound the shallots and chilli together in a mortar). Heat the oil in a wok; it makes no difference, by the way, whether you use oil, fat, or butter. Saute the shallots and chilli for a minute or so, and season with salt, soya sauce, and tomato ketchup. Put in all the rice, and stir it continuously until it is well heated: this will take 5 to 8 minutes. Serve in a good large dish, generously garnished with sliced cucumber, tomatoes, fried onions, and Krupuk. ",
      "dayofweek": "monday"
    },{  
     "url": "http://static-vegetariantimes.s3.amazonaws.com/wp-content/uploads/2011/08/CucumberGratin_MED-458x326.jpg",
      "foodName":"Cucumber Gratin",
      "theOrigin":"French",
      "ingredients":"2 Tbs. unsalted butter 2 English cucumbers or 3 garden cucumbers, peeled, halved, seeded, and cut into 2- x ½-inch strips (4 cups) ¾ tsp. salt ⅛ tsp. sugar ¼ cup chopped fresh chives 2 tsp. chopped fresh tarragon 1 tsp. coarsely chopped fresh dill 1 tsp. grated lemon zest ⅓ cup panko breadcrumbs ¼ cup grated Parmesan cheese",
      "theRecipe":"1. Preheat oven to 375°F. Melt butter in saucepan over medium heat. Cook 3 minutes, or until beginning to brown. 2. Toss cucumbers in 13- x 9-inch baking dish with 1 Tbs. brown butter, salt, and sugar. Bake 25 minutes. 3. Remove dish from oven, and preheat broiler. Add chives, tarragon, dill, and lemon zest to cucumbers, and toss to coat. Season with pepper, if desired. 4. Stir together breadcrumbs, Parmesan, and remaining 1 Tbs. brown butter in bowl. Sprinkle breadcrumb mixture over cucumbers. Broil 2 minutes, or until crumbs are golden brown.",
      "dayofweek": "tusday"
    },{  
      "url": "http://static-vegetariantimes.s3.amazonaws.com/wp-content/uploads/2015/06/Green-Bean-Salad-with-Feta-and-Walnuts-458x326.jpg",
      "foodName":"Green Bean Salad with Feta and Walnuts",
      "theOrigin":"Greek",
      "ingredients":"1 lb. green beans, trimmed (4 cups) ½ small head romaine lettuce, halved and thinly sliced (2 cups) 1 small red onion, halved and thinly sliced (1 cup) 1 cup crumbled feta cheese ½ cup halved cherry tomatoes ¼ cup chopped walnuts, Dressing : 1 tsp. dried oregano 2 tsp. red wine vinegar 1 clove garlic, minced (1 tsp.) 1 Tbs. olive oil 1 Tbs. vegetable oil ",
      "theRecipe":"1  To make Salad: Cook green beans in large pot of boiling salted water 4 minutes. Drain, rinse under cold water, and drain again. Pat dry. 2  To make Dressing: Rub oregano between fingers to crumble and release aromatic oils, and place in small bowl. Whisk in vinegar and garlic. Whisk in olive oil and vegetable oil, and season with salt and pepper, if desired. 3 Toss green beans, lettuce, and onion together with Dressing in large bowl. Fold in feta, tomatoes, and walnuts.",
      "dayofweek": "wednesday"
    },{  
      "url": "http://static-vegetariantimes.s3.amazonaws.com/wp-content/uploads/2012/03/paella_primavera-458x326.jpg",
      "foodName":"Paella Primavera",
      "theOrigin":"Spanish",
      "ingredients":"2½ tsp. olive oil 1 red bell pepper, chopped (1 cup) 6 green onions, thinly sliced (1 cup) 3 cups low-sodium vegetable broth 3 cloves garlic, minced (1 Tbs.) 1 tsp. crumbled saffron threads 1 cup short-grain white rice, such as Valencia 3 cups broccoli florets 1 cup fresh or frozen baby peas 1 cup halved grape or cherry tomatoes 12 pitted green olives, halved 12 pitted black olives, halved, optional 1 lemon, cut into wedges ¼ cup chopped fresh parsley",
      "theRecipe":"1. Heat oil in large nonstick skillet over medium heat. Add bell pepper and green onions; cook 5 minutes. Stir in broth, garlic, and saffron; bring to a boil. Sprinkle rice over ingredients, reduce heat to medium-low, and simmer, covered, 10 minutes. 2. Sprinkle broccoli, peas, tomatoes, and olives over rice. Cover, and cook paella 8 minutes, or until rice is tender. Remove from heat, and let rest, covered, 5 minutes. Season  with salt and pepper, if desired. 3. To serve, spoon paella into 6 bowls, and garnish each with lemon wedges and parsley. ",
      "dayofweek": "thursday"
    },{  
      "url": "http://toriavey.com/images/2012/10/Quinoa-Mujadara-.jpg",
      "foodName":"Mujadara",
      "theOrigin":"Syrian",
      "ingredients":"5 onions 1 cup lentils 1 cup white uncooked rice 3 cups water 1/2 tablespoon salt 3 1/2 tablespoons olive oil",
      "theRecipe":"Dice 3 onions and saute in 3 tablespoons olive oil in a saute pan until brown. Set aside. In a large saucepot, bring water and lentils to a boil. Reduce to low, cover and simmer for 15 minutes. Add onions and rice to lentils, and continue cooking for 20 minutes, or until rice and lentils are soft. Remove from heat and allow to remain in pot for a few minutes to absorb any remaining water. Slice the remaining two onions into rings. Saute rings in 1 1/2 tablespoons olive oil until brown. Place rice and lentils onto serving plate and top with sauteed onion rings.",
      "dayofweek": "friday"
    },{  
      "url": "http://static-vegetariantimes.s3.amazonaws.com/wp-content/uploads/2013/12/yellow_split_pea_dal-458x326.jpg",
      "foodName":"Yellow Split Pea Dal",
      "theOrigin":"Indian",
      "ingredients":"2 Tbs. coconut oil  1 small yellow onion, finely chopped (1 cup)  6 cloves garlic, minced (2 Tbs.)  ½ cup finely chopped carrots  1 tsp. cumin seeds  1 tsp. turmeric powder  2 tsp. red pepper flakes, plus more for garnish  1½ cups dried yellow split peas  1 lemon, juiced (2 Tbs.)  ½ cup cilantro leaves, for garnish, optional",
      "theRecipe":"1. Set rice cooker setting to “sauté” (or similar), and preheat 2 to 3 minutes. Add coconut oil, and heat 1 minute more. Add onion, garlic, and carrots, and sauté 5 to 6 minutes, or until vegetables are softened. Add cumin, turmeric, and red pepper flakes; cook 1 minute more. 2. Adjust rice cooker setting to “slow cook” (or similar). Pour in 4 cups water, stir in split peas, and season with salt and pepper, if desired. Cover, and cook 3 to 4 hours, or until peas are soft. Thin dal with water, if desired. Serve drizzled with lemon juice, and garnish with cilantro (if using). ",
      "dayofweek": "saterday"
    }
  ]

}


